import type { SVGProps } from "react";

export function IconPartners(props: SVGProps<SVGSVGElement>) {
  return (
    <svg
      xmlns="http://www.w3.org/2000/svg"
      width="240"
      height="200"
      viewBox="0 0 240 200"
      fill="none"
      stroke="currentColor"
      strokeWidth="4"
      strokeLinecap="round"
      strokeLinejoin="round"
      aria-hidden="true"
      focusable="false"
      {...props}
    >
      {/* Левая сторона рукопожатия */}
      <path
        d="
          M104 77
          L86 73
          C79 71 73 72 67 75
          L55 79
          L43 75
          C36 82 31 91 29 101
          C28 106 30 110 35 113
          L48 121
        "
      />

      {/* Правая сторона рукопожатия */}
      <path
        d="
          M151 110
          L133 122
          L108 98
          C104 94 99 93 95 96
          L85 104
          C81 107 76 106 74 102
          C72 99 73 95 76 92
          L91 80
          C97 75 103 74 110 76
          L128 81
          L139 77
        "
      />

      {/* Нижний контур ладоней */}
      <path
        d="
          M83 153
          L94 162
          C98 165 103 164 105 160
          C107 157 106 154 103 151
          L91 140

          M103 151
          L111 158
          C115 161 120 159 122 156
          C124 153 123 150 120 147
          L105 133

          M120 147
          C124 151 129 150 132 146
          C134 143 133 139 130 136
          L116 123

          M130 136
          C134 140 139 138 141 135
          C143 132 142 128 139 125
          L133 122
        "
      />

      {/* Пальцы */}
      <path
        d="
          M46 119
          L41 125
          C38 128 39 132 42 134
          C45 136 48 135 50 133
          L55 127
          C58 124 57 120 54 118
          C51 116 48 117 46 119
          Z

          M55 127
          L49 134
          C46 137 47 141 50 143
          C53 145 56 144 58 142
          L65 134
          C68 131 67 127 64 125
          C61 123 57 124 55 127
          Z

          M65 135
          L58 143
          C55 146 56 150 59 152
          C62 154 65 153 67 151
          L74 143
          C77 140 76 136 73 134
          C70 132 67 133 65 135
          Z

          M74 144
          L69 150
          C66 153 67 157 70 159
          C73 161 76 160 78 158
          L83 152
          C86 149 85 145 82 143
          C79 141 76 142 74 144
          Z
        "
      />

      {/* Щит */}
      <path
        d="
          M170 24
          C159 32 147 34 133 33
          V75
          C133 98 147 115 170 125
          C193 115 207 98 207 75
          V33
          C193 34 181 32 170 24
          Z
        "
      />

      {/* Медицинский крест */}
      <path
        d="
          M166 54
          H175
          V65
          H186
          V74
          H175
          V85
          H166
          V74
          H155
          V65
          H166
          V54
          Z
        "
      />
    </svg>
  );
}